uploading and shape assessment

In [1]:
import pandas as pd
import datetime

In [2]:
assess = pd.read_csv('assessments.csv')
courses = pd.read_csv('courses.csv')
stassess = pd.read_csv('studentAssessment.csv')
stinfo = pd.read_csv('studentInfo.csv')
streg = pd.read_csv('studentRegistration.csv')
stvle = pd.read_csv('studentVle.csv')
vle = pd.read_csv('vle.csv')

In [3]:
assess.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   code_module        206 non-null    object
 1   code_presentation  206 non-null    object
 2   id_assessment      206 non-null    int64
 3   assessment_type    206 non-null    object
 4   date               206 non-null    object
 5   weight             206 non-null    float64
dtypes: float64(1), int64(1), object(4)
memory usage: 9.8+ KB

In [4]:
assess.shape

(206, 6)

In [5]:
assess.head()

  code_module code_presentation  id_assessment assessment_type date  weight
0         AAA             2013J           1752             TMA   19    10.0
1         AAA             2013J           1753             TMA   54    20.0
2         AAA             2013J           1754             TMA  117    20.0
3         AAA             2013J           1755             TMA  166    20.0
4         AAA             2013J           1756             TMA  215    30.0

In [6]:
courses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   code_module                 22 non-null     object
 1   code_presentation           22 non-null     object
 2   module_presentation_length  22 non-null     int64
dtypes: int64(1), object(2)
memory usage: 660.0+ bytes

In [7]:
courses.shape

(22, 3)

In [8]:
courses.head()

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
4         BBB             2013B                         240

In [9]:
stassess.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173912 entries, 0 to 173911
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id_assessment   173912 non-null  int64
 1   id_student      173912 non-null  int64
 2   date_submitted  173912 non-null  int64
 3   is_banked       173912 non-null  int64
 4   score           173912 non-null  object
dtypes: int64(4), object(1)
memory usage: 6.6+ MB

In [10]:
stassess.shape

(173912, 5)

In [11]:
stassess.head()

   id_assessment  id_student  date_submitted  is_banked score
0           1752       11391              18          0    78
1           1752       28400              22          0    70
2           1752       31604              17          0    72
3           1752       32885              26          0    69
4           1752       38053              19          0    79

In [12]:
stinfo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   code_module           32593 non-null  object
 1   code_presentation     32593 non-null  object
 2   id_student            32593 non-null  int64
 3   gender                32593 non-null  object
 4   region                32593 non-null  object
 5   highest_education     32593 non-null  object
 6   imd_band              32593 non-null  object
 7   age_band              32593 non-null  object
 8   num_of_prev_attempts  32593 non-null  int64
 9   studied_credits       32593 non-null  int64
 10  disability            32593 non-null  object
 11  final_result          32593 non-null  object
dtypes: int64(3), object(9)
memory usage: 3.0+ MB

In [13]:
stinfo.shape

(32593, 12)

In [14]:
stinfo.head()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass

In [15]:
streg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   code_module          32593 non-null  object
 1   code_presentation    32593 non-null  object
 2   id_student           32593 non-null  int64
 3   date_registration    32593 non-null  object
 4   date_unregistration  32593 non-null  object
dtypes: int64(1), object(4)
memory usage: 1.2+ MB

In [16]:
streg.shape

(32593, 5)

In [17]:
streg.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159,?
1,AAA,2013J,28400,-53,?
2,AAA,2013J,30268,-92,12
3,AAA,2013J,31604,-52,?
4,AAA,2013J,32885,-176,?

In [18]:
stvle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10655280 entries, 0 to 10655279
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   code_module        object
 1   code_presentation  object
 2   id_student         int64
 3   id_site            int64
 4   date               int64
 5   sum_click          int64
dtypes: int64(4), object(2)
memory usage: 487.8+ MB

In [19]:
stvle.shape

(10655280, 6)

In [20]:
stvle.head()

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

In [21]:
vle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6364 entries, 0 to 6363
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_site            6364 non-null   int64
 1   code_module        6364 non-null   object
 2   code_presentation  6364 non-null   object
 3   activity_type      6364 non-null   object
 4   week_from          6364 non-null   object
 5   week_to            6364 non-null   object
dtypes: int64(1), object(5)
memory usage: 298.4+ KB

In [22]:
vle.shape

(6364, 6)

In [23]:
vle.head()

   id_site code_module code_presentation activity_type week_from week_to
0   546943         AAA             2013J      resource         ?       ?
1   546712         AAA             2013J     oucontent         ?       ?
2   546998         AAA             2013J      resource         ?       ?
3   546888         AAA             2013J           url         ?       ?
4   547035         AAA             2013J      resource         ?       ?

joining all data

In [24]:
ls_all_docs = [assess, courses, stassess, stinfo, streg, stvle, vle]
assess.name = 'assess'
courses.name = 'courses'
stassess.name = 'stassess'
stinfo.name = 'stinfo'
streg.name = 'streg'
stvle.name = 'stvle'
vle.name = 'vle'

In [25]:
similar_headers = []

for i, df_outer in enumerate(ls_all_docs):
    for j, df_inner in enumerate(ls_all_docs):
        if i == j:
            continue
        for column in df_outer.columns:
            if column in df_inner.columns and column not in similar_headers:
                similar_headers.append(column)

In [26]:
similar_headers

['code_module',
 'code_presentation',
 'id_assessment',
 'date',
 'id_student',
 'id_site']

In [27]:
for h in similar_headers:
    for d in ls_all_docs:
        ls = list(d.columns)
        if h in ls:
            print(f"{d.name} has {h}")

assess has code_module
courses has code_module
stinfo has code_module
streg has code_module
stvle has code_module
vle has code_module
assess has code_presentation
courses has code_presentation
stinfo has code_presentation
streg has code_presentation
stvle has code_presentation
vle has code_presentation
assess has id_assessment
stassess has id_assessment
assess has date
stvle has date
stassess has id_student
stinfo has id_student
streg has id_student
stvle has id_student
stvle has id_site
vle has id_site

In [28]:
as_co = assess.merge(courses, on = ['code_module', 'code_presentation'])
as_co.isna().sum()

code_module                   0
code_presentation             0
id_assessment                 0
assessment_type               0
date                          0
weight                        0
module_presentation_length    0
dtype: int64

In [29]:
as_co.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 206 entries, 0 to 205
Data columns (total 7 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   code_module                 206 non-null    object
 1   code_presentation           206 non-null    object
 2   id_assessment               206 non-null    int64
 3   assessment_type             206 non-null    object
 4   date                        206 non-null    object
 5   weight                      206 non-null    float64
 6   module_presentation_length  206 non-null    int64
dtypes: float64(1), int64(2), object(4)
memory usage: 12.9+ KB

In [30]:
sta_ac = stassess.merge(as_co, on = 'id_assessment')
sta_ac.isna().sum()

id_assessment                 0
id_student                    0
date_submitted                0
is_banked                     0
score                         0
code_module                   0
code_presentation             0
assessment_type               0
date                          0
weight                        0
module_presentation_length    0
dtype: int64

In [31]:
sta_ac.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 173912 entries, 0 to 173911
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   id_assessment               173912 non-null  int64
 1   id_student                  173912 non-null  int64
 2   date_submitted              173912 non-null  int64
 3   is_banked                   173912 non-null  int64
 4   score                       173912 non-null  object
 5   code_module                 173912 non-null  object
 6   code_presentation           173912 non-null  object
 7   assessment_type             173912 non-null  object
 8   date                        173912 non-null  object
 9   weight                      173912 non-null  float64
 10  module_presentation_length  173912 non-null  int64
dtypes: float64(1), int64(5), object(5)
memory usage: 15.9+ MB

In [32]:
in_re = stinfo.merge(streg, on = ['code_module', 'code_presentation', 'id_student'])
in_re.isna().sum()

code_module             0
code_presentation       0
id_student              0
gender                  0
region                  0
highest_education       0
imd_band                0
age_band                0
num_of_prev_attempts    0
studied_credits         0
disability              0
final_result            0
date_registration       0
date_unregistration     0
dtype: int64

In [33]:
in_re.shape

(32593, 14)

In [34]:
sv_vl = stvle.merge(vle, on = ['id_site', 'code_module', 'code_presentation'])
sv_vl.isna().sum()

code_module          0
code_presentation    0
id_student           0
id_site              0
date                 0
sum_click            0
activity_type        0
week_from            0
week_to              0
dtype: int64

In [35]:
sv_vl.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10655280 entries, 0 to 10655279
Data columns (total 9 columns):
 #   Column             Dtype
---  ------             -----
 0   code_module        object
 1   code_presentation  object
 2   id_student         int64
 3   id_site            int64
 4   date               int64
 5   sum_click          int64
 6   activity_type      object
 7   week_from          object
 8   week_to            object
dtypes: int64(4), object(5)
memory usage: 812.9+ MB

In [36]:
sv_vl['date']

0           -10
1           -10
2           -10
3           -10
4           -10
           ...
10655275    227
10655276    228
10655277    228
10655278    228
10655279    229
Name: date, Length: 10655280, dtype: int64

In [38]:
sacri = sta_ac.merge(in_re, on = ['code_module', 'code_presentation', 'id_student'])
sacri.isna().sum()

id_assessment                 0
id_student                    0
date_submitted                0
is_banked                     0
score                         0
code_module                   0
code_presentation             0
assessment_type               0
date                          0
weight                        0
module_presentation_length    0
gender                        0
region                        0
highest_education             0
imd_band                      0
age_band                      0
num_of_prev_attempts          0
studied_credits               0
disability                    0
final_result                  0
date_registration             0
date_unregistration           0
dtype: int64

In [39]:
sacri.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 173912 entries, 0 to 173911
Data columns (total 22 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   id_assessment               173912 non-null  int64
 1   id_student                  173912 non-null  int64
 2   date_submitted              173912 non-null  int64
 3   is_banked                   173912 non-null  int64
 4   score                       173912 non-null  object
 5   code_module                 173912 non-null  object
 6   code_presentation           173912 non-null  object
 7   assessment_type             173912 non-null  object
 8   date                        173912 non-null  object
 9   weight                      173912 non-null  float64
 10  module_presentation_length  173912 non-null  int64
 11  gender                      173912 non-null  object
 12  region                      173912 non-null  object
 13  highest_education           173912 non-null  object
 14  imd_band                    173912 non-null  object
 15  age_band                    173912 non-null  object
 16  num_of_prev_attempts        173912 non-null  int64
 17  studied_credits             173912 non-null  int64
 18  disability                  173912 non-null  object
 19  final_result                173912 non-null  object
 20  date_registration           173912 non-null  object
 21  date_unregistration         173912 non-null  object
dtypes: float64(1), int64(7), object(14)
memory usage: 30.5+ MB

In [40]:
sacri['date']

0          19
1          54
2         117
3         166
4         215
         ...
173907    229
173908    229
173909    229
173910    229
173911    229
Name: date, Length: 173912, dtype: object

In [43]:
sacri['date'] = int(sacri['date'])

TypeError: cannot convert the series to <class 'int'>

In [ ]:
merged_df = sv_vl.merge(sacri, on = ['code_module', 'code_presentation', 'date', 'id_student'])
merged_df.isna().sum()